Repository: bestwebsoft/social-login-wordpress-plugin
Catalog: languages/social-login-bws-*.po
Languages: es_es, ru_ru, uk

source: Settings
es_es: Ajustes
ru_ru: Настройки
uk: Налаштування

source: Misc
ru_ru: Разное
uk: Різне

source: Custom Code
ru_ru: Пользовательський код
uk: Користувацький код

source: Login form
ru_ru: Форма логина
uk: Форма логіну

source: Registration form
ru_ru: Форма регистрации
uk: Форма реєстрації

source: Comments form
ru_ru: Форма комментариев
uk: Форма коментарів

source: Please fill the Client ID for %s.
es_es: Por favor rellena el ID de Cliente para %s.
ru_ru: Заполните идентификатор клиента %s.
uk: Будь ласка, заповніть ідентифікатор клієнта для %s.

source: Please fill the Client secret for %s.
es_es: Por favor rellena el Secreto de Cliente para %s.
ru_ru: Заполните секрет клиента %s.
uk: Будь ласка, заповніть секрет клієнта для %s.

source: Settings saved
es_es: Ajustes guardados
ru_ru: Настройки сохранены
uk: Налаштування збережено

source: Social Login Settings
es_es: Ajustes de Social Login
ru_ru: Настройки Social Login
uk: Налаштування Social Login

source: General
ru_ru: Общие настройки
uk: Загальні налаштування

source: Buttons
ru_ru: Кнопки
uk: Кнопки

source: Enable Social Login for
es_es: Activar Social Login para
ru_ru: Включить Social Login для
uk: Включити Social Login для

source: WordPress default
ru_ru: Стандартные формы WordPress
uk: Стандартнi форми WordPress

source: Buttons Position
es_es: Posición de Botones
ru_ru: Позиция кнопок
uk: Позиція кнопок

source: Top
es_es: Arriba
ru_ru: Сверху
uk: Зверху

source: Before the submit button
es_es: Antes del botón de envío
ru_ru: Перед кнопкой подтверждения
uk: Перед кнопкою підтвердження

source: Bottom
es_es: Abajo
ru_ru: Снизу
uk: Знизу

source: Choose the buttons position in the form. This option is available only for Login and Registration forms.
es_es: Elige la posición de los botones en el formulario. Esta opción está disponible sólo para los formularios de Acceso y Registro.
ru_ru: Выберите позицию кнопок в форме. Эта опция доступна только для форм логина и регистрации.
uk: Оберіть позицію кнопок у формі. Ця опція доступна лише для форм логіна і реєстрації.

source: User Registration
ru_ru: Регистрация пользователей
uk: Реєстрація користувачів

source: Default
ru_ru: По умолчанию
uk: За замовчуванням

source: Allow
ru_ru: Разрешить
uk: Дозволити

source: Deny
ru_ru: Запретить
uk: Заборонити

source: Allow or deny user registration using social buttons regardless %s.
ru_ru: Разрешить или запретить регистрацию пользователей через социальные кнопки независимо от %s.
uk: Дозволити чи заборонити реєстрацію користувачів через соціальні кнопки незалежно від %s.

source: WordPress General settings
ru_ru: основных настроек WordPress
uk: основних налаштувань WordPress

source: New User Default Role
ru_ru: Роль нового пользователя
uk: Роль нового користувача

source: Choose a default role for newly registered users.
ru_ru: Выберите стандартную роль для новых зарегистрированных пользователей.
uk: Оберіть стандартну роль для нових зареєстрованих користувачів.

source: Client ID
es_es: ID de Cliente
ru_ru: Идентификатор клиента
uk: Ідентифікатор клієнта

source: You need to create your own credentials in order to use google API.
es_es: Necesitas crear tus propias credenciales para usar Google API.
ru_ru: Для того, чтобы использовать Google API, вам необходимо создать свои собственные учетные данные.
uk: Щоб використовувати Google API, вам потрібно створити свої власні облікові дані .

source: Learn More
es_es: Aprende más
ru_ru: Подробнее
uk: Дізнатись більше

source: Client Secret
es_es: Secreto de Cliente
ru_ru: Секрет клиента
uk: Секрет клієнта

source: Button Style
ru_ru: Стиль кнопки
uk: Стиль кнопки

source: Dark
ru_ru: Тёмная
uk: Темна

source: Light
ru_ru: Светлая
uk: Свiтла

source: Button Label Text
ru_ru: Текст кнопки
uk: Текст кнопки

source: App ID
es_es: ID de aplicación
ru_ru: Идентификатор приложения
uk: Ідентифікатор додатка

source: You need to create your own credentials in order to use Facebook API.
es_es: Necesitas crear tus propias credenciales para usar Facebook API.
ru_ru: Для того, чтобы использовать Facebook API, вам необходимо создать свои собственные учетные данные.
uk: Щоб використовувати Facebook API, вам потрібно створити свої власні облікові дані .

source: App Secret
es_es: Secreto de aplicación
ru_ru: Секрет приложения
uk: Секрет додатка

source: Button Display
ru_ru: Отображение кнопки
uk: Вiдображення кнопки

source: Consumer Key (API Key)
es_es: Clave de consumidor (Clave de API)
ru_ru: Ключ пользователя (ключ приложения)
uk: Споживчий ключ (ключ додатка)

source: You need to create your own credentials in order to use twitter API.
es_es: Necesitas crear tus propias credenciales para usar Twitter API.
ru_ru: Для того, чтобы использовать Twitter API, вам необходимо создать свои собственные учетные данные.
uk: Щоб використовувати Twitter API, вам потрібно створити свої власні облікові дані .

source: Consumer Secret (API Secret)
es_es: Secreto de consumidor (Secreto de API)
ru_ru: Секрет пользователя (секрет приложения)
uk: Споживчий секрет (секрет додатка)

source: You need to create your own credentials in order to use linkedin API.
es_es: Necesitas crear tus propias credenciales para usar Linkedin API.
ru_ru: Для того, чтобы использовать LinkedIn API, вам необходимо создать свои собственные учетные данные.
uk: Щоб використовувати LinkedIn API, вам потрібно створити свої власні облікові дані .

source: Delete User Metadata
ru_ru: Удалить метаданные пользователя
uk: Видалити метаданнi користувача

source: Enable to delete all user metadata when deleting the plugin.
ru_ru: Включите, чтобы удалить метаданные всех пользователей при удалении плагина.
uk: Увімкніть, щоб видалити метаданнi всiх користувачiв пiдчас видалення плагiну.

source: requires
ru_ru: Требования
uk: вимагає

source: or higher, that is why it has been deactivated! Please upgrade your PHP version and try again.
ru_ru: или выше, поэтому он был отключен! Обновите версию PHP и повторите попытку.
uk: або вище, тому він був відключений! Будь ласка, Оновіть версію PHP і спробуйте ще раз.

source: Back to the WordPress
ru_ru: Назад к WordPress
uk: Назад до WordPress

source: Plugins page
ru_ru: Страница плагина
uk: Сторінка плагінів

source: WARNING
ru_ru: ВНИМАНИЕ
uk: УВАГА

source: The plugin works correctly only if JavaScript is enabled.
ru_ru: Плагин работает корректно только при включенном JavaScript.
uk: Плагін працює коректно тільки при включеному JavaScript.

source: ERROR
ru_ru: Ошибка
uk: Помилка

source: This email is already registered, please choose another one.
es_es: Este correo electrónico ya está registrado, por favor elige otro.
ru_ru: Этот email уже зарегистрирован, пожалуйста, выберите другой.
uk: Цей email вже зареєстрований, будь ласка, оберіть інший.

source: You're going to allow user registration via social buttons regardless WordPress default settings. Make sure that you understand the consequences. Check the following
ru_ru: Вы собираетесь разрешить регистрацию пользователей через социальные кнопки независимо от основных настроек WordPress. Убедитесь, что вы понимаете последствия. Прочитайте следующую
uk: Ви збираєтеся дозволити реєстрацію користувачів через соціальні кнопки незалежно від основних налаштувань WordPress. Переконайтеся, що ви розумієте наслідки. Прочитайте наступню

source: article
ru_ru: статью
uk: статтю

source: You're going to deny user registration via social buttons regardless WordPress default settings. Make sure that you understand the consequences. Check the following
ru_ru: Вы собираетесь запретить регистрацию пользователей через социальные кнопки независимо от основных настроек WordPress. Убедитесь, что вы понимаете последствия. Прочитайте следующую
uk: Ви збираєтеся заборонити реєстрацію користувачів через соціальні кнопки незалежно від основних налаштувань WordPress. Переконайтеся, що ви розумієте наслідки. Прочитайте наступню

source: please allow the access to your profile information.
es_es: por favor permite el acceso a la información de tu perfil.
ru_ru: разрешите доступ к вашей информации о профиле.
uk: будь-ласка, дозвольте отримати доступ до інформації вашого профілю.

source: failed to register new user.
es_es: error al registrar nuevo usuario.
ru_ru: ошибка при регистрации нового пользователя
uk: не вдалося зареєструвати нового користувача.

source: new users registration is disabled.
es_es: registro de nuevos usuarios está desactivado.
ru_ru: регистрация новых пользователей отключена.
uk: реєстрація нових користувачів відключена.

source: you need to verify your Account Email.
es_es: necesitas verificar el correo electrónico de tu cuenta.
ru_ru: вам необходимо подтвердить свою учетную запись электронной почты.
uk: вам потрібно підтвердити адресу електронної пошти аккаунту.

source: user data is insufficient for registration.
es_es: datos de usuario son insuficientes para el registro.
ru_ru: пользовательских данных недостаточно для регистрации.
uk: Користувацькі дані недостатні для реєстрації.

source: provided token data is invalid.
es_es: proporcionados datos de token no son válidos.
ru_ru: данные токена недействительны.
uk: токен дані недійсні.

source: provided token is invalid.
es_es: token proporcionado no es válido.
ru_ru: токен некорректен.
uk: токен недійсний.

source: login failed.
es_es: error de acceso.
ru_ru: ошибка авторизации.
uk: помилка авторизації.

source: Error
ru_ru: Ошибка
uk: Помилка

source: Enter %s to enable sign in with Social Login button.
es_es: Introduce %s para activar el acceso con el botón de Social Login.
ru_ru: Введите %s для возможности использования кнопки Social Login.
uk: Введіть %s для того, щоб увійти в систему з кнопкою Social Login.

source: existing Gmail address
es_es: dirección de Gmail existente
ru_ru: существующий адрес Gmail
uk: існуючу адресу Gmail

source: existing email address of Facebook account
es_es: ingrese la dirección de correo electrónico existente de la cuenta de Facebook
ru_ru: электронную почту существующего аккаунта Facebook
uk: електронну пошту існуючого аккаунта в Facebook

source: existing email address of Twitter account
es_es: ingrese la dirección de correo electrónico existente de la cuenta de Twitter
ru_ru: электронную почту существующего аккаунта Twitter
uk: електронну пошту існуючого аккаунта в Twitter

source: existing email address of LinkedIn account
es_es: ingrese la dirección de correo electrónico existente de la cuenta de LinkedIn
ru_ru: электронную почту существующего аккаунта LinkedIn
uk: електронну пошту існуючого аккаунта в LinkedIn

source: Social Login Accounts
es_es: Сuentas de Social Login
ru_ru: Аккаунты Social Login
uk: Облікові записи Social Login

source: The %1$s you specified for %2$s Account is already used by another user.
es_es: La %1$s especificada para cuenta de %2$s ya está utilizada por otro usuario.
ru_ru: Указанный вами %1$s для учетной записи %2$s уже используются другим пользователем.
uk: %1$s ви вказали для %2$s акаунту вже використовується іншим користувачем.

source: email address
es_es: dirección de correo electrónico
ru_ru: email адрес
uk: Email

source: Please enter valid %1$s Account %2$s
es_es: Por favor introduce %2$s válido para cuenta de %1$s
ru_ru: Пожалуйста, заполните корректно %2$s для аккаунта %1$s
uk: Будь ласка, введіть дійсний %2$s для облікового запису %1$s

source: Support
es_es: Soporte
ru_ru: Поддержка
uk: Підтримка

source: WordPress Login form
es_es: Formulario de Acceso de WordPress

source: WordPress Registration form
es_es: Formulario de Registro de WordPress

source: WordPress Comments form
es_es: Formulario de Comentarios de WordPress

source: %1$s Sign In Button
es_es: Botón Acceder con %1$s

source: Enable to add %1$s Sign In button to the necessary WordPress form.
es_es: Activa para añadir el botón Acceder con %1$s al formulario necesario de WordPress.

source: While creating Google API use this redirect url:
es_es: Al crear Google API utiliza esta URL de redirección:

source: While creating Facebook API use this redirect url:
es_es: Al crear Facebook API utiliza esta URL de redirección:

source: While creating Twitter API use this redirect url:
es_es: Al crear Twitter API utiliza esta URL de redirección:

source: While creating LinkedIn API use this redirect url:
es_es: Al crear LinkedIn API utiliza esta URL de redirección:

source: email
es_es: correo electrónico
